app/Http/Controllers/ItemsController.php

            );
        }
        // die("before saving");
        $item->save();
---
insert into `items` (`name`, `description`, `price`, `category_id`, `vat`, `image`, `updated_at`, `created_at`) values ('{\"en\":\"test\"}', '{\"en\":\"test\"}', '98', '100', 0, '4da69938-320c-46b6-93fc-368d38c3de27', '2021-12-26 19:26:38', '2021-12-26 19:26:38')

            }
        }

        $item->update();
---
update `items` set `name` = '{\"fr\":\"Oklm\",\"en\":\"Pantalon Anthony Morato\"}', `description` = '{\"fr\":\"Oklmm\",\"en\":\"Taille S\"}', `price` = '29.99', `category_id` = '100', `available` = 1, `has_variants` = 0, `items`.`updated_at` = '2021-12-26 19:25:55' where `id` = 393